app/controllers/price_calculator_controller.rb

  def index
    @products = Product.all
    @levels = Product.distinct.pluck(:level).compact.sort
---
SELECT "products".* FROM "products"
SELECT DISTINCT "products"."level" FROM "products"

  def upload_csv
    if params[:csv_file].present?
      begin
        # Clear existing products
        Product.destroy_all

        # Parse CSV file - handle files with headers not on first row
        csv_lines = File.readlines(params[:csv_file].tempfile)

        # Find the header row (contains "Product Family")
        header_line_index = csv_lines.find_index { |line| line.include?("Product Family") }

        if header_line_index.nil?
          raise "Could not find header row with 'Product Family' column"
        end

        # Create a new CSV string starting from the header row
        csv_content = csv_lines[header_line_index..-1].join

        # Parse the CSV content
        csv_data = CSV.parse(csv_content, headers: true)

        csv_data.each_with_index do |row, index|
          # Read ONLY the specific columns you mentioned
          product_name = row['Product Family']
          level_detail = row['Level Detail']
          dtp_price = row['Unit DTP per Year / Per Txn']
          part_number = row['Part Number']

          # Skip rows with missing essential data
          next if product_name.blank? || level_detail.blank? || dtp_price.blank?
---
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 71]]
SELECT "products".* FROM "products"
SELECT "products"."name", "products"."dtp_price" FROM "products" WHERE "products"."level" = ?  [["level", "Bronze"]]

          # Use Part Number from CSV if available, otherwise generate one
          final_part_number = part_number.present? ? part_number : "PN-#{index + 1}-#{normalized_level.to_s.gsub(/\s+/, '')}"

          Product.create!(
            name: product_name,
            level: normalized_level,
            dtp_price: dtp_price,
            part_number: final_part_number
          )
        end

        flash[:success] = "CSV file uploaded successfully! #{Product.count} products imported with level normalization."
---
INSERT INTO "products" ("name", "level", "dtp_price", "created_at", "updated_at", "part_number") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Education"], ["level", "Level 1"], ["dtp_price", 150.0], ["created_at", "2025-10-27 06:16:38.749290"], ["updated_at", "2025-10-27 06:16:38.749290"], ["part_number", "PN-1-Level1"]]
SELECT COUNT(*) FROM "products"

  def products
    @products = Product.where(level: params[:level]).pluck(:name, :dtp_price, :part_number)
---
SELECT "products"."name", "products"."dtp_price" FROM "products" WHERE "products"."level" = ?  [["level", "Bronze"]]

  def search_products
    level = params[:level]
    query = params[:query]

            if level.present? && query.present?
              @products = Product.where(level: level)
                                .where("name LIKE ?", "%#{query}%")
                                .pluck(:name, :dtp_price, :part_number)
---
SELECT "products"."name", "products"."dtp_price", "products"."part_number" FROM "products" WHERE "products"."level" = ? AND (name ILIKE '%Education%')  [["level", "Level 1"]]

  def search_part_numbers
    level = params[:level]
    query = params[:query]

            if level.present? && query.present?
              @part_numbers = Product.where(level: level)
                                    .where("part_number LIKE ?", "%#{query}%")
                                    .pluck(:part_number, :name, :dtp_price)
              render json: @part_numbers.map { |part_number, name, price| { part_number: part_number, name: name, dtp_price: price } }
---
SELECT "products"."name", "products"."dtp_price", "products"."part_number" FROM "products" WHERE "products"."level" = ? AND (name LIKE '%AI Assistant for Acrobat for enterprise%')  [["level", "Level 1"]]