app/controllers/price_calculator_controller.rb

SELECT COUNT(*) FROM "products"
---
          end
        end

        flash[:success] = "CSV file uploaded successfully! #{Product.count} products imported with level normalization."